In [52]:
import numpy as np
import pandas as pd

In [54]:
df=pd.read_csv("Social_Network_Ads.csv")

In [56]:
df.sample(5)

      User ID  Gender  Age  EstimatedSalary  Purchased
283  15663249  Female   52            21000          1
295  15725794  Female   36            63000          0
373  15708791    Male   59           130000          1
8    15600575    Male   25            33000          0
397  15654296  Female   50            20000          1

In [78]:
from sklearn.impute import SimpleImputer

In [80]:
si = SimpleImputer()

In [82]:
df['Purchased'] = si.fit_transform(df[['Purchased']])

In [84]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [86]:
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000        0.0
1  15810944    Male   35            20000        0.0
2  15668575  Female   26            43000        0.0

In [88]:
df['Purchased'].value_counts()

Purchased
0.0    257
1.0    143
Name: count, dtype: int64

In [110]:
df['Purchased'] = df['Purchased'].map({0.0:0 , 1.0:1})
df['Gender'] = df['Gender'].map({'Female':0 , 'Male':1})

In [112]:
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0

In [114]:
x=df.drop(columns = ['Purchased'])
# x

In [116]:
y=df['Purchased']
# y

In [118]:
from sklearn.model_selection import train_test_split

In [120]:
x_train , x_test , y_train  , y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [122]:
np.round(x_train.describe() , 2)

           User ID  Gender     Age  EstimatedSalary
count       320.00   320.0  320.00           320.00
mean   15689066.37     0.5   37.87         70281.25
std       71974.25     0.5   10.21         34430.55
min    15569641.00     0.0   18.00         15000.00
25%    15622771.00     0.0   30.00         43000.00
50%    15689969.50     0.5   37.00         71000.00
75%    15747470.00     1.0   45.00         88000.00
max    15815236.00     1.0   60.00        150000.00

In [124]:
from sklearn.preprocessing import MinMaxScaler

In [126]:
mn = MinMaxScaler()

In [128]:
x_train_mn = mn.fit_transform(x_train)

In [130]:
x_train_new = pd.DataFrame(x_train_mn , columns = x_train.columns)

In [132]:
np.round(x_train_new.describe() , 2)

       User ID  Gender     Age  EstimatedSalary
count   320.00   320.0  320.00           320.00
mean      0.49     0.5    0.47             0.41
std       0.29     0.5    0.24             0.26
min       0.00     0.0    0.00             0.00
25%       0.22     0.0    0.29             0.21
50%       0.49     0.5    0.45             0.41
75%       0.72     1.0    0.64             0.54
max       1.00     1.0    1.00             1.00